Обработки/Reports/_АнкетаНРА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_АнкетаНРА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_АнкетаНРА/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Анкета ""НРА""",
		"1.04",
		"",
		Истина
	);
		
	// Команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики();
	Механизм = "ВнешнийОтчет._АнкетаНРА.ПриКомпоновкеРезультата()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	Настройки = КомпоновщикНастроек.Настройки;
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация",			ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Граница",				Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период",					НачалоДня(ЭтотОбъект.Период.ДатаОкончания));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЮрФизЛицоОрганизации",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо"));
	
	
	ВнешниеНаборыДанных = Новый Структура("ДанныеОтчета", ПолучитьДанныеОтчета()); 
	ДополнительныеПараметры = Новый Структура("РегистрацияСтатистики", Ложь);
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка,,,, ВнешниеНаборыДанных, ДополнительныеПараметры);
	
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ПолучитьДанныеОтчета() Экспорт

	МассивДат = Новый Массив;
	НоваяДата = КонецГода(ЭтотОбъект.Период.ДатаНачала);
	Пока НоваяДата < ЭтотОбъект.Период.ДатаОкончания Цикл
	
		МассивДат.Добавить(НоваяДата);
		НоваяДата = КонецГода(НоваяДата + 1);
	
	КонецЦикла; 
	МассивДат.Добавить(ЭтотОбъект.Период.ДатаОкончания);
	
	ДанныеОтчета = Неопределено;
	
	Для каждого Дата Из МассивДат Цикл
	
		ТаблицаОтчета = ПолучитьТаблицуОтчета(Дата);
		Если ДанныеОтчета = Неопределено Тогда
			ДанныеОтчета = ТаблицаОтчета.Скопировать();
		Иначе
			РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ТаблицаОтчета, ДанныеОтчета);
		КонецЕсли; 
	
	КонецЦикла; 
	
	Возврат ДанныеОтчета;
	
КонецФункции

Функция ПолучитьТаблицуОтчета(Дата)

	Запрос = Новый Запрос;
	
	ПоследнийРабочийДень = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, Дата);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("КонецПериода", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ПоследнийРабочийДень", ПоследнийРабочийДень);
	
	#Область Текст_запроса_актуальные_счета_ДУ
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ТОГДА ВЫБОР
		|					КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
		|						ТОГДА ""активы закрытых ПИФ, включая ПИФ недвижимости""
		|					ИНАЧЕ ""активы открытых и интервальных ПИФ, АИФ""
		|				КОНЕЦ
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ""пенсионные резервы НПФ""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ""пенсионные накопления НПФ""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ТОГДА ""пенсионные накопления ПФР""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
		|			ТОГДА ""страховые резервы""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
		|			ТОГДА ""активы фондов целевого капитала""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
		|			ТОГДА ""активы компенсационного фонда СРО""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
		|			ТОГДА ""активы Военной ипотеки""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний))
		|			ТОГДА ""индивидуальное доверительное управление корпоратов""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|			ТОГДА ""индивидуальное доверительное управление физ. лиц ""
		|		ИНАЧЕ ""прочее""
		|	КОНЕЦ КАК РазделОтчета,
		|	ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|			ТОГДА ВЫБОР
		|					КОГДА ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый)
		|						ТОГДА 2
		|					ИНАЧЕ 1
		|				КОНЕЦ
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА 3
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА 4
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
		|			ТОГДА 5
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
		|			ТОГДА 6
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов)
		|			ТОГДА 7
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
		|			ТОГДА 8
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих)
		|			ТОГДА 9
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний))
		|			ТОГДА 10
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|			ТОГДА 11
		|		ИНАЧЕ 12
		|	КОНЕЦ КАК ПорядокРазделов,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _РазделыОтчета
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПаевыеИнвестиционныеФонды
		|			ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПаевыеИнвестиционныеФонды.Ссылка
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения > &КонецПериода)
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &КонецПериода
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.Собственный)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК Период
		|ПОМЕСТИТЬ _ДатаПервойОперации
		|ИЗ
		|	_РазделыОтчета КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	МИНИМУМ(ВложенныйЗапрос.Период)
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ОстаткиДенежныхСредств.Период КАК Период
		|	ИЗ
		|		РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РазделыОтчета КАК СчетаДоверительногоУправления
		|			ПО ОстаткиДенежныхСредств.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|				И (СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|	ГДЕ
		|		ОстаткиДенежныхСредств.Активность
		|		И ОстаткиДенежныхСредств.Период <= КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОстаткиЦенныхБумаг.СчетДоверительногоУправления,
		|		ОстаткиЦенныхБумаг.Период
		|	ИЗ
		|		РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РазделыОтчета КАК СчетаДоверительногоУправления
		|			ПО ОстаткиЦенныхБумаг.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|				И (СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет))
		|	ГДЕ
		|		ОстаткиЦенныхБумаг.Активность
		|		И ОстаткиЦенныхБумаг.Период <= КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Ссылка КАК Ссылка,
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	_СчетаДоверительногоУправления.Организация КАК Организация,
		|	_СчетаДоверительногоУправления.РазделОтчета КАК РазделОтчета,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_ДатаПервойОперации.Период КАК ДатаЗаключения,
		|	_СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	_СчетаДоверительногоУправления.ПорядокРазделов КАК ПорядокРазделов
		|ПОМЕСТИТЬ _АктуальныеСчетаДоверительногоУправления
		|ИЗ
		|	_РазделыОтчета КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатаПервойОперации КАК _ДатаПервойОперации
		|		ПО _СчетаДоверительногоУправления.Ссылка = _ДатаПервойОперации.СчетДоверительногоУправления";
	#КонецОбласти 
	
	Запрос.Выполнить();
	
	Если НачалоДня(ПоследнийРабочийДень) = НачалоДня(Дата) Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СчетаДоверительногоУправления.Организация КАК Организация,
			|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
			|	&КонецПериода КАК Дата
			|ПОМЕСТИТЬ _ДатыРасчетаСЧА
			|ИЗ
			|	_АктуальныеСчетаДоверительногоУправления КАК _СчетаДоверительногоУправления";
		Запрос.Выполнить();
	Иначе
		ПоместитьТаблицуДатРасчетаСЧАВМенеджерВременныхТаблиц(Запрос);
	КонецЕсли; 
		
	#Область Текст_запроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&КонецПериода КАК Дата,
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	_СчетаДоверительногоУправления.РазделОтчета КАК РазделОтчета,
		|	_СчетаДоверительногоУправления.ПорядокРазделов КАК ПорядокРазделов,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	ЕСТЬNULL(СЧА.Значение, 0) КАК СЧА
		|ИЗ
		|	_АктуальныеСчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыРасчетаСЧА КАК _ДатыРасчетаСЧА
		|		ПО _СчетаДоверительногоУправления.Организация = _ДатыРасчетаСЧА.Организация
		|			И _СчетаДоверительногоУправления.Ссылка = _ДатыРасчетаСЧА.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СЧА
		|		ПО (СЧА.СубъектАналитики = _ДатыРасчетаСЧА.СчетДоверительногоУправления)
		|			И (СЧА.Период = _ДатыРасчетаСЧА.Дата)
		|			И (СЧА.Организация = _ДатыРасчетаСЧА.Организация)
		|			И (СЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|ГДЕ
		|	ЕСТЬNULL(СЧА.Значение, 0) <> 0";
	#КонецОбласти 
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
 

Процедура ПоместитьТаблицуДатРасчетаСЧАВМенеджерВременныхТаблиц(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Организация КАК Организация,
		|	_СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(_СчетаДоверительногоУправления.ДатаЗаключения, ДЕНЬ) < &ПоследнийРабочийДень
		|			ТОГДА &ПоследнийРабочийДень
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(_СчетаДоверительногоУправления.ДатаЗаключения, ДЕНЬ)
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА _СчетаДоверительногоУправления.ДатаРасторжения > &КонецПериода
		|				ИЛИ _СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &КонецПериода
		|		ИНАЧЕ _СчетаДоверительногоУправления.ДатаРасторжения
		|	КОНЕЦ КАК ДатаОкончания
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	_АктуальныеСчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|";
	
	Запрос.Выполнить();
	
	ПараметрыДатСЧА = Новый Структура("ВидДействия, ДополнитьРабочимиДнями, ИмяТаблицыДатДействияЗаПериод, УдалитьВсеВременныеТаблицы", 
									"СЧА", Ложь, "_ВсеДатыРасчетаСЧА", Истина);
	
	Запрос.Текст = Справочники.НастройкиРегламентныхДействий.ПолучитьТекстЗапросаПоДатамРегламентныхДействий(ПараметрыДатСЧА);
	
	Запрос.Текст = стрЗаменить(Запрос.Текст, "&ДатаС", "&ПоследнийРабочийДень");
	Запрос.Текст = стрЗаменить(Запрос.Текст, "&ДатаПо", "&КонецПериода");
	
	Запрос.Выполнить();
	
	Запрос.Текст = 	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеДатыРасчетаСЧА.Организация КАК Организация,
		|	_ВсеДатыРасчетаСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МАКСИМУМ(_ВсеДатыРасчетаСЧА.Дата) КАК Дата
		|ПОМЕСТИТЬ _ДатыРасчетаСЧА
		|ИЗ
		|	_ВсеДатыРасчетаСЧА КАК _ВсеДатыРасчетаСЧА
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВсеДатыРасчетаСЧА.СчетДоверительногоУправления,
		|	_ВсеДатыРасчетаСЧА.Организация";
	Запрос.Выполнить();
	
	Запрос.Текст = 	
		"УНИЧТОЖИТЬ _СчетаДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ВсеДатыРасчетаСЧА";
		
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьИдентификаторОрганизацииВБухгалтерии(Организация)

	Если Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
		ИдентификаторОрганизацииВБухгалтерии = "24f247b5-fc83-4b90-94b9-f48f5b4c897b";
	ИначеЕсли Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда
		ИдентификаторОрганизацииВБухгалтерии = "25edd09e-d191-42ba-8dad-254d7b4f535d";
	ИначеЕсли Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
		ИдентификаторОрганизацииВБухгалтерии = "a10bacb9-5299-11e3-934d-000c29e4a50d";
	ИначеЕсли Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_МДТраст") Тогда
		ИдентификаторОрганизацииВБухгалтерии = "eb907965-5cfb-11e9-80d1-005056ae724d";
	КонецЕсли;
	
	Возврат ИдентификаторОрганизацииВБухгалтерии;

КонецФункции
 
Функция ПолучитьСтоимостьССИзБухгалтерии()

	ИдентификаторОрганизации = ПолучитьИдентификаторОрганизацииВБухгалтерии(ЭтотОбъект.Организация);
	
	Бухгалтерия	= РаботаСВнешнимиСистемами.ПолучитьCOMСоединениеСБухгалтерией(ЭтотОбъект.Организация);
	
	Запрос = Бухгалтерия.NewObject("Запрос");
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РЕГ_XBRL_0420514СобственныеСредства.Сумма КАК Сумма
		|ИЗ
		|	Документ.РЕГ_XBRL_0420514.СобственныеСредства КАК РЕГ_XBRL_0420514СобственныеСредства
		|ГДЕ
		|	РЕГ_XBRL_0420514СобственныеСредства.Ссылка.Организация = &Организация
		|	И РЕГ_XBRL_0420514СобственныеСредства.Ссылка.ДатаКон = &Дата
		|	И (РЕГ_XBRL_0420514СобственныеСредства.КодСтроки = ""07""
		|			ИЛИ РЕГ_XBRL_0420514СобственныеСредства.ИДПоказателя = ""RazmerSobstvennyxSredstv"")
		|	И НЕ РЕГ_XBRL_0420514СобственныеСредства.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	РЕГ_XBRL_0420514СобственныеСредства.Ссылка.Дата УБЫВ";	
	
	Запрос.УстановитьПараметр("Организация",	Бухгалтерия.Справочники.Организации.ПолучитьСсылку(Бухгалтерия.NewObject("УникальныйИдентификатор", ИдентификаторОрганизации)));
	Запрос.УстановитьПараметр("Дата",			НачалоДня(ЭтотОбъект.Период.ДатаОкончания));

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВерсиюОтчета(ДатаОкончания) Экспорт

	Если ДатаОкончания <= КонецКвартала('20210101') Тогда
		ВерсияОтчета = 1;
	ИначеЕсли ДатаОкончания <= '20210630235959' Тогда
		ВерсияОтчета = 2;
	Иначе
		ВерсияОтчета = 3;
	КонецЕсли; 
	
	Возврат ВерсияОтчета;

КонецФункции

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики() Экспорт
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", 	ЭтотОбъект.Организация);
	ПараметрыОтчета.Вставить("ДатаНачала", 		ЭтотОбъект.Период.ДатаНачала);
	ПараметрыОтчета.Вставить("ДатаОкончания", 	ЭтотОбъект.Период.ДатаОкончания);
	ПараметрыОтчета.Вставить("Версия", 			СведенияОВнешнейОбработке().Версия);
	
	Описание = "";
	
	Для каждого Параметр Из ПараметрыОтчета Цикл
	
		Описание = Описание + Символы.ПС + Параметр.Ключ + ": " + Параметр.Значение;
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции
